import { object, string } from 'yup';


export const searchFormSchema = object({
    ori: string()
        .required("لطفا نام شهر معتر را وارد کنید")
        .typeError('مقدار وارد شده باید رشته باشد')
        .max(20, "تعداد کاراکتر بیشتر از حد مجاز است")
        .min(2, "حداقل 2 کاراکتر وارد کنید")
        .matches(/^[\u0600-\u06FF\s]+$/, 'ورودی نباید شامل عدد باشد')
    ,
    des: string()
        .required("لطفا نام شهر معتر را وارد کنید")
        .typeError('مقدار وارد شده باید رشته باشد')
        .max(20, "تعداد کاراکتر بیشتر از حد مجاز است")
        .min(2, "حداقل 2 کاراکتر وارد کنید")
        .matches(/^[\u0600-\u06FF\s]+$/, 'ورودی نباید شامل عدد باشد')

});

